---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.PeriodicCurveBadParams
source: html/9d99d99b-72f2-be50-1ad1-d69f6e3f53c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.PeriodicCurveBadParams Property

End positions are invalid.

## Syntax (C#)
```csharp
public static FailureDefinitionId PeriodicCurveBadParams { get; }
```